TexasInstruments/mcal_am263x/mcal/I2c/V0/Cdd_I2c_hw_reg.h
/*
 * TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 * Copyright (c) 2023 Texas Instruments Incorporated
 *
 * All rights reserved not granted herein.
 *
 * Limited License.
 *
 * Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 * license under copyrights and patents it now or hereafter owns or controls to
 * make, have made, use, import, offer to sell and sell ("Utilize") this software
 * subject to the terms herein. With respect to the foregoing patent license,
 * such license is granted solely to the extent that any such patent is necessary
 * to Utilize the software alone. The patent license shall not apply to any
 * combinations which include this software, other than combinations with devices
 * manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 * Redistributions must preserve existing copyright notices and reproduce this license
 * (including the above copyright notice and the disclaimer and (if applicable) source
 * code license limitations below) in the documentation and/or other materials provided
 * with the distribution.
 *
 * Redistribution and use in binary form, without modification, are permitted provided
 * that the following conditions are met:
 * No reverse engineering, decompilation, or disassembly of this software is
 * permitted with respect to any software provided in binary form.
 * Any redistribution and use are licensed by TI for use only with TI Devices.
 * Nothing shall obligate TI to provide you with source code for the software
 * licensed and provided to you in object code.
 *
 * If software source code is provided to you, modification and redistribution of the
 * source code are permitted provided that the following conditions are met:
 * Any redistribution and use of the source code, including any resulting derivative
 * works, are licensed by TI for use only with TI Devices.
 * Any redistribution and use of any object code compiled from the source code
 * and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 * may be used to endorse or promote products derived from this software without
 * specific prior written permission.
 *
 * DISCLAIMER.
 *
 * THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 * AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 * LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
 *  \file     Cdd_I2c_hw_reg.h
 *
 *  \brief    This file contains all the I2C register offset addresses and mask values
 *
 */

#ifndef CDD_I2C_HW_REG_H_
#define CDD_I2C_HW_REG_H_

/* ================================================================ */
/*                             Include Files                        */
/* ================================================================ */

/*None*/

/**************************************************************************
 * Register Macros
 **************************************************************************/

#define CDD_I2C_ICOAR         (0x00000000U)
#define CDD_I2C_ICIMR         (0x00000004U)
#define CDD_I2C_ICSTR         (0x00000008U)
#define CDD_I2C_ICCLKL        (0x0000000CU)
#define CDD_I2C_ICCLKH        (0x00000010U)
#define CDD_I2C_ICCNT         (0x00000014U)
#define CDD_I2C_ICDRR         (0x00000018U)
#define CDD_I2C_ICSAR         (0x0000001CU)
#define CDD_I2C_ICDXR         (0x00000020U)
#define CDD_I2C_ICMDR         (0x00000024U)
#define CDD_I2C_ICIVR         (0x00000028U)
#define CDD_I2C_ICEMDR        (0x0000002CU)
#define CDD_I2C_ICPSC         (0x00000030U)
#define CDD_I2C_ICPID1        (0x00000034U)
#define CDD_I2C_ICPID2        (0x00000038U)
#define CDD_I2C_ICDMAC        (0x0000003CU)
#define CDD_I2C_I2C_RESERVED1 (0x00000040U)
#define CDD_I2C_I2C_RESERVED2 (0x00000044U)
#define CDD_I2C_ICPFUNC       (0x00000048U)
#define CDD_I2C_ICPDIR        (0x0000004CU)
#define CDD_I2C_ICPDIN        (0x00000050U)
#define CDD_I2C_ICPDOUT       (0x00000054U)
#define CDD_I2C_ICPDSET       (0x00000058U)
#define CDD_I2C_ICPDCLR       (0x0000005CU)
#define CDD_I2C_ICPDRV        (0x00000060U)

/**************************************************************************
 * Field Definition Macros
 **************************************************************************/

/* ICOAR */

#define CDD_I2C_ICOAR_OADDR_MASK     (0x000003FFU)
#define CDD_I2C_ICOAR_OADDR_SHIFT    (0x00000000U)
#define CDD_I2C_ICOAR_OADDR_RESETVAL (0x00000000U)
#define CDD_I2C_ICOAR_OADDR_MAX      (0x000003FFU)

#define CDD_I2C_ICOAR_NU_MASK     (0xFFFFFC00U)
#define CDD_I2C_ICOAR_NU_SHIFT    (0x0000000AU)
#define CDD_I2C_ICOAR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICOAR_NU_MAX      (0x003FFFFFU)

#define CDD_I2C_ICOAR_RESETVAL (0x00000000U)

/* ICIMR */

#define CDD_I2C_ICIMR_AL_MASK     (0x00000001U)
#define CDD_I2C_ICIMR_AL_SHIFT    (0x00000000U)
#define CDD_I2C_ICIMR_AL_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_AL_MAX      (0x00000001U)

/*----AL Tokens----*/
#define CDD_I2C_ICIMR_AL_DISABLE (0x00000000U)
#define CDD_I2C_ICIMR_AL_ENABLE  (0x00000001U)

#define CDD_I2C_ICIMR_NACK_MASK     (0x00000002U)
#define CDD_I2C_ICIMR_NACK_SHIFT    (0x00000001U)
#define CDD_I2C_ICIMR_NACK_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_NACK_MAX      (0x00000001U)

/*----NACK Tokens----*/
#define CDD_I2C_ICIMR_NACK_DISABLE (0x00000000U)
#define CDD_I2C_ICIMR_NACK_ENABLE  (0x00000001U)

