TexasInstruments/mcal_am263x/mcal/I2c/V0/Cdd_I2c_hw_reg.h
#define CDD_I2C_ICIMR_ARDY_MASK     (0x00000004U)
#define CDD_I2C_ICIMR_ARDY_SHIFT    (0x00000002U)
#define CDD_I2C_ICIMR_ARDY_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_ARDY_MAX      (0x00000001U)

/*----ARDY Tokens----*/
#define CDD_I2C_ICIMR_ARDY_DISABLE (0x00000000U)
#define CDD_I2C_ICIMR_ARDY_ENABLE  (0x00000001U)

#define CDD_I2C_ICIMR_ICRRDY_MASK     (0x00000008U)
#define CDD_I2C_ICIMR_ICRRDY_SHIFT    (0x00000003U)
#define CDD_I2C_ICIMR_ICRRDY_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_ICRRDY_MAX      (0x00000001U)

/*----ICRRDY Tokens----*/
#define CDD_I2C_ICIMR_ICRRDY_DISABLE (0x00000000U)
#define CDD_I2C_ICIMR_ICRRDY_ENABLE  (0x00000001U)

#define CDD_I2C_ICIMR_ICXRDY_MASK     (0x00000010U)
#define CDD_I2C_ICIMR_ICXRDY_SHIFT    (0x00000004U)
#define CDD_I2C_ICIMR_ICXRDY_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_ICXRDY_MAX      (0x00000001U)

/*----ICXRDY Tokens----*/
#define CDD_I2C_ICIMR_ICXRDY_DISABLE (0x00000000U)
#define CDD_I2C_ICIMR_ICXRDY_ENABLE  (0x00000001U)

#define CDD_I2C_ICIMR_SCD_MASK     (0x00000020U)
#define CDD_I2C_ICIMR_SCD_SHIFT    (0x00000005U)
#define CDD_I2C_ICIMR_SCD_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_SCD_MAX      (0x00000001U)

/*----SCD Tokens----*/
#define CDD_I2C_ICIMR_SCD_DISABLE (0x00000000U)
#define CDD_I2C_ICIMR_SCD_ENABLE  (0x00000001U)

#define CDD_I2C_ICIMR_AAS_MASK     (0x00000040U)
#define CDD_I2C_ICIMR_AAS_SHIFT    (0x00000006U)
#define CDD_I2C_ICIMR_AAS_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_AAS_MAX      (0x00000001U)

/*----AAS Tokens----*/
#define CDD_I2C_ICIMR_AAS_DISABLE (0x00000000U)
#define CDD_I2C_ICIMR_AAS_ENABLE  (0x00000001U)

#define CDD_I2C_ICIMR_NU_MASK     (0xFFFFFF80U)
#define CDD_I2C_ICIMR_NU_SHIFT    (0x00000007U)
#define CDD_I2C_ICIMR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICIMR_NU_MAX      (0x01FFFFFFU)

#define CDD_I2C_ICIMR_RESETVAL (0x00000000U)

/* ICSTR */

#define CDD_I2C_ICSTR_AL_MASK     (0x00000001U)
#define CDD_I2C_ICSTR_AL_SHIFT    (0x00000000U)
#define CDD_I2C_ICSTR_AL_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_AL_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_NACK_MASK     (0x00000002U)
#define CDD_I2C_ICSTR_NACK_SHIFT    (0x00000001U)
#define CDD_I2C_ICSTR_NACK_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_NACK_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_ARDY_MASK     (0x00000004U)
#define CDD_I2C_ICSTR_ARDY_SHIFT    (0x00000002U)
#define CDD_I2C_ICSTR_ARDY_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_ARDY_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_ICRRDY_MASK     (0x00000008U)
#define CDD_I2C_ICSTR_ICRRDY_SHIFT    (0x00000003U)
#define CDD_I2C_ICSTR_ICRRDY_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_ICRRDY_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_ICXRDY_MASK     (0x00000010U)
#define CDD_I2C_ICSTR_ICXRDY_SHIFT    (0x00000004U)
#define CDD_I2C_ICSTR_ICXRDY_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_ICXRDY_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_SCD_MASK     (0x00000020U)
#define CDD_I2C_ICSTR_SCD_SHIFT    (0x00000005U)
#define CDD_I2C_ICSTR_SCD_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_SCD_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_NU1_MASK     (0x000000C0U)
#define CDD_I2C_ICSTR_NU1_SHIFT    (0x00000006U)
#define CDD_I2C_ICSTR_NU1_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_NU1_MAX      (0x00000003U)

#define CDD_I2C_ICSTR_AD0_MASK     (0x00000100U)
#define CDD_I2C_ICSTR_AD0_SHIFT    (0x00000008U)
#define CDD_I2C_ICSTR_AD0_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_AD0_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_AAS_MASK     (0x00000200U)
#define CDD_I2C_ICSTR_AAS_SHIFT    (0x00000009U)
#define CDD_I2C_ICSTR_AAS_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_AAS_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_XSMT_MASK     (0x00000400U)
#define CDD_I2C_ICSTR_XSMT_SHIFT    (0x0000000AU)
#define CDD_I2C_ICSTR_XSMT_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_XSMT_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_RSFULL_MASK     (0x00000800U)
#define CDD_I2C_ICSTR_RSFULL_SHIFT    (0x0000000BU)
#define CDD_I2C_ICSTR_RSFULL_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_RSFULL_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_BB_MASK     (0x00001000U)
#define CDD_I2C_ICSTR_BB_SHIFT    (0x0000000CU)
#define CDD_I2C_ICSTR_BB_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_BB_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_NACKSNT_MASK     (0x00002000U)
#define CDD_I2C_ICSTR_NACKSNT_SHIFT    (0x0000000DU)
#define CDD_I2C_ICSTR_NACKSNT_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_NACKSNT_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_SDIR_MASK     (0x00004000U)
#define CDD_I2C_ICSTR_SDIR_SHIFT    (0x0000000EU)
#define CDD_I2C_ICSTR_SDIR_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_SDIR_MAX      (0x00000001U)

#define CDD_I2C_ICSTR_NU2_MASK     (0xFFFF8000U)
#define CDD_I2C_ICSTR_NU2_SHIFT    (0x0000000FU)
#define CDD_I2C_ICSTR_NU2_RESETVAL (0x00000000U)
#define CDD_I2C_ICSTR_NU2_MAX      (0x0001FFFFU)

#define CDD_I2C_ICSTR_RESETVAL (0x00000000U)

/* ICCLKL */

#define CDD_I2C_ICCLKL_ICCL_MASK     (0x0000FFFFU)
#define CDD_I2C_ICCLKL_ICCL_SHIFT    (0x00000000U)
#define CDD_I2C_ICCLKL_ICCL_RESETVAL (0x00000000U)
#define CDD_I2C_ICCLKL_ICCL_MAX      (0x0000FFFFU)

#define CDD_I2C_ICCLKL_NU_MASK     (0xFFFF0000U)
#define CDD_I2C_ICCLKL_NU_SHIFT    (0x00000010U)
#define CDD_I2C_ICCLKL_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICCLKL_NU_MAX      (0x0000FFFFU)

#define CDD_I2C_ICCLKL_RESETVAL (0x00000000U)

/* ICCLKH */

#define CDD_I2C_ICCLKH_ICCH_MASK     (0x0000FFFFU)
#define CDD_I2C_ICCLKH_ICCH_SHIFT    (0x00000000U)
#define CDD_I2C_ICCLKH_ICCH_RESETVAL (0x00000000U)
#define CDD_I2C_ICCLKH_ICCH_MAX      (0x0000FFFFU)

#define CDD_I2C_ICCLKH_NU_MASK     (0xFFFF0000U)
#define CDD_I2C_ICCLKH_NU_SHIFT    (0x00000010U)
#define CDD_I2C_ICCLKH_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICCLKH_NU_MAX      (0x0000FFFFU)

#define CDD_I2C_ICCLKH_RESETVAL (0x00000000U)

/* ICCNT */

#define CDD_I2C_ICCNT_ICDC_MASK     (0x0000FFFFU)
#define CDD_I2C_ICCNT_ICDC_SHIFT    (0x00000000U)
#define CDD_I2C_ICCNT_ICDC_RESETVAL (0x00000000U)
#define CDD_I2C_ICCNT_ICDC_MAX      (0x0000FFFFU)

#define CDD_I2C_ICCNT_NU_MASK     (0xFFFF0000U)
#define CDD_I2C_ICCNT_NU_SHIFT    (0x00000010U)
#define CDD_I2C_ICCNT_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICCNT_NU_MAX      (0x0000FFFFU)

#define CDD_I2C_ICCNT_RESETVAL (0x00000000U)

