TexasInstruments/mcal_am263x/mcal/I2c/V0/Cdd_I2c_hw_reg.h
/* ICDRR */

#define CDD_I2C_ICDRR_D_MASK     (0x000000FFU)
#define CDD_I2C_ICDRR_D_SHIFT    (0x00000000U)
#define CDD_I2C_ICDRR_D_RESETVAL (0x00000000U)
#define CDD_I2C_ICDRR_D_MAX      (0x000000FFU)

#define CDD_I2C_ICDRR_NU_MASK     (0xFFFFFF00U)
#define CDD_I2C_ICDRR_NU_SHIFT    (0x00000008U)
#define CDD_I2C_ICDRR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICDRR_NU_MAX      (0x00FFFFFFU)

#define CDD_I2C_ICDRR_RESETVAL (0x00000000U)

/* ICSAR */

#define CDD_I2C_ICSAR_SADDR_MASK     (0x000003FFU)
#define CDD_I2C_ICSAR_SADDR_SHIFT    (0x00000000U)
#define CDD_I2C_ICSAR_SADDR_RESETVAL (0x00000000U)
#define CDD_I2C_ICSAR_SADDR_MAX      (0x000003FFU)

#define CDD_I2C_ICSAR_NU_MASK     (0xFFFFFC00U)
#define CDD_I2C_ICSAR_NU_SHIFT    (0x0000000AU)
#define CDD_I2C_ICSAR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICSAR_NU_MAX      (0x003FFFFFU)

#define CDD_I2C_ICSAR_RESETVAL (0x00000000U)

/* ICDXR */

#define CDD_I2C_ICDXR_D_MASK     (0x000000FFU)
#define CDD_I2C_ICDXR_D_SHIFT    (0x00000000U)
#define CDD_I2C_ICDXR_D_RESETVAL (0x00000000U)
#define CDD_I2C_ICDXR_D_MAX      (0x000000FFU)

#define CDD_I2C_ICDXR_NU_MASK     (0xFFFFFF00U)
#define CDD_I2C_ICDXR_NU_SHIFT    (0x00000008U)
#define CDD_I2C_ICDXR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICDXR_NU_MAX      (0x00FFFFFFU)

#define CDD_I2C_ICDXR_RESETVAL (0x00000000U)

/* ICMDR */

#define CDD_I2C_ICMDR_BC_MASK     (0x00000007U)
#define CDD_I2C_ICMDR_BC_SHIFT    (0x00000000U)
#define CDD_I2C_ICMDR_BC_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_BC_MAX      (0x00000007U)

#define CDD_I2C_ICMDR_FDF_MASK     (0x00000008U)
#define CDD_I2C_ICMDR_FDF_SHIFT    (0x00000003U)
#define CDD_I2C_ICMDR_FDF_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_FDF_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_STB_MASK     (0x00000010U)
#define CDD_I2C_ICMDR_STB_SHIFT    (0x00000004U)
#define CDD_I2C_ICMDR_STB_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_STB_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_IRS_MASK     (0x00000020U)
#define CDD_I2C_ICMDR_IRS_SHIFT    (0x00000005U)
#define CDD_I2C_ICMDR_IRS_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_IRS_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_DLB_MASK     (0x00000040U)
#define CDD_I2C_ICMDR_DLB_SHIFT    (0x00000006U)
#define CDD_I2C_ICMDR_DLB_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_DLB_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_RM_MASK     (0x00000080U)
#define CDD_I2C_ICMDR_RM_SHIFT    (0x00000007U)
#define CDD_I2C_ICMDR_RM_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_RM_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_XA_MASK     (0x00000100U)
#define CDD_I2C_ICMDR_XA_SHIFT    (0x00000008U)
#define CDD_I2C_ICMDR_XA_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_XA_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_TRX_MASK     (0x00000200U)
#define CDD_I2C_ICMDR_TRX_SHIFT    (0x00000009U)
#define CDD_I2C_ICMDR_TRX_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_TRX_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_MST_MASK     (0x00000400U)
#define CDD_I2C_ICMDR_MST_SHIFT    (0x0000000AU)
#define CDD_I2C_ICMDR_MST_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_MST_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_STP_MASK     (0x00000800U)
#define CDD_I2C_ICMDR_STP_SHIFT    (0x0000000BU)
#define CDD_I2C_ICMDR_STP_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_STP_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_NU1_MASK     (0x00001000U)
#define CDD_I2C_ICMDR_NU1_SHIFT    (0x0000000CU)
#define CDD_I2C_ICMDR_NU1_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_NU1_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_STT_MASK     (0x00002000U)
#define CDD_I2C_ICMDR_STT_SHIFT    (0x0000000DU)
#define CDD_I2C_ICMDR_STT_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_STT_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_FREE_MASK     (0x00004000U)
#define CDD_I2C_ICMDR_FREE_SHIFT    (0x0000000EU)
#define CDD_I2C_ICMDR_FREE_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_FREE_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_NACKMOD_MASK     (0x00008000U)
#define CDD_I2C_ICMDR_NACKMOD_SHIFT    (0x0000000FU)
#define CDD_I2C_ICMDR_NACKMOD_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_NACKMOD_MAX      (0x00000001U)

#define CDD_I2C_ICMDR_NU2_MASK     (0xFFFF0000U)
#define CDD_I2C_ICMDR_NU2_SHIFT    (0x00000010U)
#define CDD_I2C_ICMDR_NU2_RESETVAL (0x00000000U)
#define CDD_I2C_ICMDR_NU2_MAX      (0x0000FFFFU)

#define CDD_I2C_ICMDR_RESETVAL (0x00000000U)

/* ICIVR */

#define CDD_I2C_ICIVR_INTCODE_MASK     (0x00000007U)
#define CDD_I2C_ICIVR_INTCODE_SHIFT    (0x00000000U)
#define CDD_I2C_ICIVR_INTCODE_RESETVAL (0x00000000U)
#define CDD_I2C_ICIVR_INTCODE_MAX      (0x00000007U)

/*----INTCODE Tokens----*/
#define CDD_I2C_ICIVR_INTCODE_NONE (0x00000000U)
#define CDD_I2C_ICIVR_INTCODE_AL   (0x00000001U)
#define CDD_I2C_ICIVR_INTCODE_NACK (0x00000002U)
#define CDD_I2C_ICIVR_INTCODE_RAR  (0x00000003U)
#define CDD_I2C_ICIVR_INTCODE_RDR  (0x00000004U)
#define CDD_I2C_ICIVR_INTCODE_TDR  (0x00000005U)
#define CDD_I2C_ICIVR_INTCODE_SCD  (0x00000006U)
#define CDD_I2C_ICIVR_INTCODE_AAS  (0x00000007U)

#define CDD_I2C_ICIVR_NU1_MASK     (0x000000F8U)
#define CDD_I2C_ICIVR_NU1_SHIFT    (0x00000003U)
#define CDD_I2C_ICIVR_NU1_RESETVAL (0x00000000U)
#define CDD_I2C_ICIVR_NU1_MAX      (0x0000001FU)

#define CDD_I2C_ICIVR_TESTMD_MASK     (0x00000F00U)
#define CDD_I2C_ICIVR_TESTMD_SHIFT    (0x00000008U)
#define CDD_I2C_ICIVR_TESTMD_RESETVAL (0x00000000U)
#define CDD_I2C_ICIVR_TESTMD_MAX      (0x0000000FU)

#define CDD_I2C_ICIVR_NU2_MASK     (0xFFFFF000U)
#define CDD_I2C_ICIVR_NU2_SHIFT    (0x0000000CU)
#define CDD_I2C_ICIVR_NU2_RESETVAL (0x00000000U)
#define CDD_I2C_ICIVR_NU2_MAX      (0x000FFFFFU)

#define CDD_I2C_ICIVR_RESETVAL (0x00000000U)

/* ICEMDR */

#define CDD_I2C_ICEMDR_BCM_MASK     (0x00000001U)
#define CDD_I2C_ICEMDR_BCM_SHIFT    (0x00000000U)
#define CDD_I2C_ICEMDR_BCM_RESETVAL (0x00000000U)
#define CDD_I2C_ICEMDR_BCM_MAX      (0x00000001U)

#define CDD_I2C_ICEMDR_IGNACK_MASK     (0x00000002U)
#define CDD_I2C_ICEMDR_IGNACK_SHIFT    (0x00000001U)
#define CDD_I2C_ICEMDR_IGNACK_RESETVAL (0x00000000U)
#define CDD_I2C_ICEMDR_IGNACK_MAX      (0x00000001U)

#define CDD_I2C_ICEMDR_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICEMDR_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICEMDR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICEMDR_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICEMDR_RESETVAL (0x00000000U)

/* ICPSC */

#define CDD_I2C_ICPSC_IPSC_MASK     (0x000000FFU)
#define CDD_I2C_ICPSC_IPSC_SHIFT    (0x00000000U)
#define CDD_I2C_ICPSC_IPSC_RESETVAL (0x00000000U)
#define CDD_I2C_ICPSC_IPSC_MAX      (0x000000FFU)

#define CDD_I2C_ICPSC_NU_MASK     (0xFFFFFF00U)
#define CDD_I2C_ICPSC_NU_SHIFT    (0x00000008U)
#define CDD_I2C_ICPSC_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPSC_NU_MAX      (0x00FFFFFFU)

