TexasInstruments/mcal_am263x/mcal/I2c/V0/Cdd_I2c_hw_reg.h
#define CDD_I2C_ICPSC_RESETVAL (0x00000000U)

/* ICPID1 */

#define CDD_I2C_ICPID1_REVISION_MASK     (0x000000FFU)
#define CDD_I2C_ICPID1_REVISION_SHIFT    (0x00000000U)
#define CDD_I2C_ICPID1_REVISION_RESETVAL (0x00000000U)
#define CDD_I2C_ICPID1_REVISION_MAX      (0x000000FFU)

#define CDD_I2C_ICPID1_CLASS_MASK     (0x0000FF00U)
#define CDD_I2C_ICPID1_CLASS_SHIFT    (0x00000008U)
#define CDD_I2C_ICPID1_CLASS_RESETVAL (0x00000000U)
#define CDD_I2C_ICPID1_CLASS_MAX      (0x000000FFU)

#define CDD_I2C_ICPID1_NU_MASK     (0xFFFF0000U)
#define CDD_I2C_ICPID1_NU_SHIFT    (0x00000010U)
#define CDD_I2C_ICPID1_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPID1_NU_MAX      (0x0000FFFFU)

#define CDD_I2C_ICPID1_RESETVAL (0x00000000U)

/* ICPID2 */

#define CDD_I2C_ICPID2_TYPE_MASK     (0x000000FFU)
#define CDD_I2C_ICPID2_TYPE_SHIFT    (0x00000000U)
#define CDD_I2C_ICPID2_TYPE_RESETVAL (0x00000000U)
#define CDD_I2C_ICPID2_TYPE_MAX      (0x000000FFU)

#define CDD_I2C_ICPID2_NU_MASK     (0xFFFFFF00U)
#define CDD_I2C_ICPID2_NU_SHIFT    (0x00000008U)
#define CDD_I2C_ICPID2_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPID2_NU_MAX      (0x00FFFFFFU)

#define CDD_I2C_ICPID2_RESETVAL (0x00000000U)

/* ICDMAC */

#define CDD_I2C_ICDMAC_RXDMAEN_MASK     (0x00000001U)
#define CDD_I2C_ICDMAC_RXDMAEN_SHIFT    (0x00000000U)
#define CDD_I2C_ICDMAC_RXDMAEN_RESETVAL (0x00000000U)
#define CDD_I2C_ICDMAC_RXDMAEN_MAX      (0x00000001U)

#define CDD_I2C_ICDMAC_TXDMAEN_MASK     (0x00000002U)
#define CDD_I2C_ICDMAC_TXDMAEN_SHIFT    (0x00000001U)
#define CDD_I2C_ICDMAC_TXDMAEN_RESETVAL (0x00000000U)
#define CDD_I2C_ICDMAC_TXDMAEN_MAX      (0x00000001U)

#define CDD_I2C_ICDMAC_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICDMAC_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICDMAC_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICDMAC_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICDMAC_RESETVAL (0x00000000U)

/* I2C_RESERVED1 */

#define CDD_I2C_I2C_RESERVED1_NU_MASK     (0xFFFFFFFFU)
#define CDD_I2C_I2C_RESERVED1_NU_SHIFT    (0x00000000U)
#define CDD_I2C_I2C_RESERVED1_NU_RESETVAL (0x00000000U)
#define CDD_I2C_I2C_RESERVED1_NU_MAX      (0xFFFFFFFFU)

#define CDD_I2C_I2C_RESERVED1_RESETVAL (0x00000000U)

/* I2C_RESERVED2 */

#define CDD_I2C_I2C_RESERVED2_NU_MASK     (0xFFFFFFFFU)
#define CDD_I2C_I2C_RESERVED2_NU_SHIFT    (0x00000000U)
#define CDD_I2C_I2C_RESERVED2_NU_RESETVAL (0x00000000U)
#define CDD_I2C_I2C_RESERVED2_NU_MAX      (0xFFFFFFFFU)

#define CDD_I2C_I2C_RESERVED2_RESETVAL (0x00000000U)

/* ICPFUNC */

#define CDD_I2C_ICPFUNC_PFUNC0_MASK     (0x00000001U)
#define CDD_I2C_ICPFUNC_PFUNC0_SHIFT    (0x00000000U)
#define CDD_I2C_ICPFUNC_PFUNC0_RESETVAL (0x00000000U)
#define CDD_I2C_ICPFUNC_PFUNC0_MAX      (0x00000001U)

#define CDD_I2C_ICPFUNC_NU_MASK     (0xFFFFFFFEU)
#define CDD_I2C_ICPFUNC_NU_SHIFT    (0x00000001U)
#define CDD_I2C_ICPFUNC_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPFUNC_NU_MAX      (0x7FFFFFFFU)

#define CDD_I2C_ICPFUNC_RESETVAL (0x00000000U)

/* ICPDIR */

#define CDD_I2C_ICPDIR_PDIR0_MASK     (0x00000001U)
#define CDD_I2C_ICPDIR_PDIR0_SHIFT    (0x00000000U)
#define CDD_I2C_ICPDIR_PDIR0_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDIR_PDIR0_MAX      (0x00000001U)

#define CDD_I2C_ICPDIR_PDIR1_MASK     (0x00000002U)
#define CDD_I2C_ICPDIR_PDIR1_SHIFT    (0x00000001U)
#define CDD_I2C_ICPDIR_PDIR1_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDIR_PDIR1_MAX      (0x00000001U)

#define CDD_I2C_ICPDIR_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICPDIR_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICPDIR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDIR_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICPDIR_RESETVAL (0x00000000U)

/* ICPDIN */

#define CDD_I2C_ICPDIN_PDIN0_MASK     (0x00000001U)
#define CDD_I2C_ICPDIN_PDIN0_SHIFT    (0x00000000U)
#define CDD_I2C_ICPDIN_PDIN0_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDIN_PDIN0_MAX      (0x00000001U)

#define CDD_I2C_ICPDIN_PDIN1_MASK     (0x00000002U)
#define CDD_I2C_ICPDIN_PDIN1_SHIFT    (0x00000001U)
#define CDD_I2C_ICPDIN_PDIN1_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDIN_PDIN1_MAX      (0x00000001U)

#define CDD_I2C_ICPDIN_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICPDIN_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICPDIN_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDIN_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICPDIN_RESETVAL (0x00000000U)

/* ICPDOUT */

#define CDD_I2C_ICPDOUT_PDOUT0_MASK     (0x00000001U)
#define CDD_I2C_ICPDOUT_PDOUT0_SHIFT    (0x00000000U)
#define CDD_I2C_ICPDOUT_PDOUT0_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDOUT_PDOUT0_MAX      (0x00000001U)

#define CDD_I2C_ICPDOUT_PDOUT1_MASK     (0x00000002U)
#define CDD_I2C_ICPDOUT_PDOUT1_SHIFT    (0x00000001U)
#define CDD_I2C_ICPDOUT_PDOUT1_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDOUT_PDOUT1_MAX      (0x00000001U)

#define CDD_I2C_ICPDOUT_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICPDOUT_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICPDOUT_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDOUT_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICPDOUT_RESETVAL (0x00000000U)

/* ICPDSET */

#define CDD_I2C_ICPDSET_PDSET0_MASK     (0x00000001U)
#define CDD_I2C_ICPDSET_PDSET0_SHIFT    (0x00000000U)
#define CDD_I2C_ICPDSET_PDSET0_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDSET_PDSET0_MAX      (0x00000001U)

#define CDD_I2C_ICPDSET_PDSET1_MASK     (0x00000002U)
#define CDD_I2C_ICPDSET_PDSET1_SHIFT    (0x00000001U)
#define CDD_I2C_ICPDSET_PDSET1_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDSET_PDSET1_MAX      (0x00000001U)

#define CDD_I2C_ICPDSET_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICPDSET_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICPDSET_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDSET_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICPDSET_RESETVAL (0x00000000U)

/* ICPDCLR */

#define CDD_I2C_ICPDCLR_PDCLR0_MASK     (0x00000001U)
#define CDD_I2C_ICPDCLR_PDCLR0_SHIFT    (0x00000000U)
#define CDD_I2C_ICPDCLR_PDCLR0_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDCLR_PDCLR0_MAX      (0x00000001U)

#define CDD_I2C_ICPDCLR_PDCLR1_MASK     (0x00000002U)
#define CDD_I2C_ICPDCLR_PDCLR1_SHIFT    (0x00000001U)
#define CDD_I2C_ICPDCLR_PDCLR1_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDCLR_PDCLR1_MAX      (0x00000001U)

#define CDD_I2C_ICPDCLR_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICPDCLR_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICPDCLR_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDCLR_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICPDCLR_RESETVAL (0x00000000U)

/* ICPDRV */

#define CDD_I2C_ICPDRV_PDRV0_MASK     (0x00000001U)
#define CDD_I2C_ICPDRV_PDRV0_SHIFT    (0x00000000U)
#define CDD_I2C_ICPDRV_PDRV0_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDRV_PDRV0_MAX      (0x00000001U)

#define CDD_I2C_ICPDRV_PDRV1_MASK     (0x00000002U)
#define CDD_I2C_ICPDRV_PDRV1_SHIFT    (0x00000001U)
#define CDD_I2C_ICPDRV_PDRV1_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDRV_PDRV1_MAX      (0x00000001U)

#define CDD_I2C_ICPDRV_NU_MASK     (0xFFFFFFFCU)
#define CDD_I2C_ICPDRV_NU_SHIFT    (0x00000002U)
#define CDD_I2C_ICPDRV_NU_RESETVAL (0x00000000U)
#define CDD_I2C_ICPDRV_NU_MAX      (0x3FFFFFFFU)

#define CDD_I2C_ICPDRV_RESETVAL (0x00000000U)

#endif
